program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3520.4.1"}, {"coremlc-version", "3520.5.1"}, {"coremltools-component-torch", "2.12.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0"}})]
{
    func main<ios16>(tensor<fp16, [1, 3, 512, 512]> input) {
            tensor<string, []> input_1_pad_type_0 = const()[name = tensor<string, []>("input_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_1_pad_0 = const()[name = tensor<string, []>("input_1_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_1_strides_0 = const()[name = tensor<string, []>("input_1_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_1_dilations_0 = const()[name = tensor<string, []>("input_1_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_1_groups_0 = const()[name = tensor<string, []>("input_1_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 3, 3, 3]> conv_first_weight_to_fp16 = const()[name = tensor<string, []>("conv_first_weight_to_fp16"), val = tensor<fp16, [64, 3, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [64]> conv_first_bias_to_fp16 = const()[name = tensor<string, []>("conv_first_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3584)))];
            tensor<fp16, [1, 64, 512, 512]> input_1_cast_fp16 = conv(bias = conv_first_bias_to_fp16, dilations = input_1_dilations_0, groups = input_1_groups_0, pad = input_1_pad_0, pad_type = input_1_pad_type_0, strides = input_1_strides_0, weight = conv_first_weight_to_fp16, x = input)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<int32, []> var_21 = const()[name = tensor<string, []>("op_21"), val = tensor<int32, []>(1)];
            tensor<string, []> input_3_pad_type_0 = const()[name = tensor<string, []>("input_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_3_pad_0 = const()[name = tensor<string, []>("input_3_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_3_strides_0 = const()[name = tensor<string, []>("input_3_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_3_dilations_0 = const()[name = tensor<string, []>("input_3_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_3_groups_0 = const()[name = tensor<string, []>("input_3_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 64, 3, 3]> body_0_rdb1_conv1_weight_to_fp16 = const()[name = tensor<string, []>("body_0_rdb1_conv1_weight_to_fp16"), val = tensor<fp16, [32, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3776)))];
            tensor<fp16, [32]> body_0_rdb1_conv1_bias_to_fp16 = const()[name = tensor<string, []>("body_0_rdb1_conv1_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(40704)))];
            tensor<fp16, [1, 32, 512, 512]> input_3_cast_fp16 = conv(bias = body_0_rdb1_conv1_bias_to_fp16, dilations = input_3_dilations_0, groups = input_3_groups_0, pad = input_3_pad_0, pad_type = input_3_pad_type_0, strides = input_3_strides_0, weight = body_0_rdb1_conv1_weight_to_fp16, x = input_1_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<fp16, []> var_20_to_fp16 = const()[name = tensor<string, []>("op_20_to_fp16"), val = tensor<fp16, []>(0x1.998p-3)];
            tensor<fp16, [1, 32, 512, 512]> x1_1_cast_fp16 = leaky_relu(alpha = var_20_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("x1_1_cast_fp16")];
            tensor<bool, []> input_5_interleave_0 = const()[name = tensor<string, []>("input_5_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 96, 512, 512]> input_5_cast_fp16 = concat(axis = var_21, interleave = input_5_interleave_0, values = (input_1_cast_fp16, x1_1_cast_fp16))[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<string, []> input_7_pad_type_0 = const()[name = tensor<string, []>("input_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_7_pad_0 = const()[name = tensor<string, []>("input_7_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_7_strides_0 = const()[name = tensor<string, []>("input_7_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_7_dilations_0 = const()[name = tensor<string, []>("input_7_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_7_groups_0 = const()[name = tensor<string, []>("input_7_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 96, 3, 3]> body_0_rdb1_conv2_weight_to_fp16 = const()[name = tensor<string, []>("body_0_rdb1_conv2_weight_to_fp16"), val = tensor<fp16, [32, 96, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(40832)))];
            tensor<fp16, [32]> body_0_rdb1_conv2_bias_to_fp16 = const()[name = tensor<string, []>("body_0_rdb1_conv2_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(96192)))];
            tensor<fp16, [1, 32, 512, 512]> input_7_cast_fp16 = conv(bias = body_0_rdb1_conv2_bias_to_fp16, dilations = input_7_dilations_0, groups = input_7_groups_0, pad = input_7_pad_0, pad_type = input_7_pad_type_0, strides = input_7_strides_0, weight = body_0_rdb1_conv2_weight_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<fp16, [1, 32, 512, 512]> x2_1_cast_fp16 = leaky_relu(alpha = var_20_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("x2_1_cast_fp16")];
            tensor<bool, []> input_9_interleave_0 = const()[name = tensor<string, []>("input_9_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 128, 512, 512]> input_9_cast_fp16 = concat(axis = var_21, interleave = input_9_interleave_0, values = (input_1_cast_fp16, x1_1_cast_fp16, x2_1_cast_fp16))[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<string, []> input_11_pad_type_0 = const()[name = tensor<string, []>("input_11_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_11_pad_0 = const()[name = tensor<string, []>("input_11_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_11_strides_0 = const()[name = tensor<string, []>("input_11_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_11_dilations_0 = const()[name = tensor<string, []>("input_11_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_11_groups_0 = const()[name = tensor<string, []>("input_11_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 128, 3, 3]> body_0_rdb1_conv3_weight_to_fp16 = const()[name = tensor<string, []>("body_0_rdb1_conv3_weight_to_fp16"), val = tensor<fp16, [32, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(96320)))];
            tensor<fp16, [32]> body_0_rdb1_conv3_bias_to_fp16 = const()[name = tensor<string, []>("body_0_rdb1_conv3_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(170112)))];
            tensor<fp16, [1, 32, 512, 512]> input_11_cast_fp16 = conv(bias = body_0_rdb1_conv3_bias_to_fp16, dilations = input_11_dilations_0, groups = input_11_groups_0, pad = input_11_pad_0, pad_type = input_11_pad_type_0, strides = input_11_strides_0, weight = body_0_rdb1_conv3_weight_to_fp16, x = input_9_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<fp16, [1, 32, 512, 512]> x3_1_cast_fp16 = leaky_relu(alpha = var_20_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("x3_1_cast_fp16")];
            tensor<bool, []> input_13_interleave_0 = const()[name = tensor<string, []>("input_13_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 160, 512, 512]> input_13_cast_fp16 = concat(axis = var_21, interleave = input_13_interleave_0, values = (input_1_cast_fp16, x1_1_cast_fp16, x2_1_cast_fp16, x3_1_cast_fp16))[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<string, []> input_15_pad_type_0 = const()[name = tensor<string, []>("input_15_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_15_pad_0 = const()[name = tensor<string, []>("input_15_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_15_strides_0 = const()[name = tensor<string, []>("input_15_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_15_dilations_0 = const()[name = tensor<string, []>("input_15_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_15_groups_0 = const()[name = tensor<string, []>("input_15_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 160, 3, 3]> body_0_rdb1_conv4_weight_to_fp16 = const()[name = tensor<string, []>("body_0_rdb1_conv4_weight_to_fp16"), val = tensor<fp16, [32, 160, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(170240)))];
            tensor<fp16, [32]> body_0_rdb1_conv4_bias_to_fp16 = const()[name = tensor<string, []>("body_0_rdb1_conv4_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(262464)))];
            tensor<fp16, [1, 32, 512, 512]> input_15_cast_fp16 = conv(bias = body_0_rdb1_conv4_bias_to_fp16, dilations = input_15_dilations_0, groups = input_15_groups_0, pad = input_15_pad_0, pad_type = input_15_pad_type_0, strides = input_15_strides_0, weight = body_0_rdb1_conv4_weight_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<fp16, [1, 32, 512, 512]> x4_1_cast_fp16 = leaky_relu(alpha = var_20_to_fp16, x = input_15_cast_fp16)[name = tensor<string, []>("x4_1_cast_fp16")];
            tensor<bool, []> input_17_interleave_0 = const()[name = tensor<string, []>("input_17_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 192, 512, 512]> input_17_cast_fp16 = concat(axis = var_21, interleave = input_17_interleave_0, values = (input_1_cast_fp16, x1_1_cast_fp16, x2_1_cast_fp16, x3_1_cast_fp16, x4_1_cast_fp16))[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<string, []> x5_1_pad_type_0 = const()[name = tensor<string, []>("x5_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x5_1_pad_0 = const()[name = tensor<string, []>("x5_1_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> x5_1_strides_0 = const()[name = tensor<string, []>("x5_1_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> x5_1_dilations_0 = const()[name = tensor<string, []>("x5_1_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> x5_1_groups_0 = const()[name = tensor<string, []>("x5_1_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 192, 3, 3]> var_104_weight_0_to_fp16 = const()[name = tensor<string, []>("op_104_weight_0_to_fp16"), val = tensor<fp16, [64, 192, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(262592)))];
            tensor<fp16, [64]> var_104_bias_0_to_fp16 = const()[name = tensor<string, []>("op_104_bias_0_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(483840)))];
            tensor<fp16, [1, 64, 512, 512]> var_104_cast_fp16 = conv(bias = var_104_bias_0_to_fp16, dilations = x5_1_dilations_0, groups = x5_1_groups_0, pad = x5_1_pad_0, pad_type = x5_1_pad_type_0, strides = x5_1_strides_0, weight = var_104_weight_0_to_fp16, x = input_17_cast_fp16)[name = tensor<string, []>("op_104_cast_fp16")];
            tensor<fp16, [1, 64, 512, 512]> input_19_cast_fp16 = add(x = var_104_cast_fp16, y = input_1_cast_fp16)[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<string, []> input_21_pad_type_0 = const()[name = tensor<string, []>("input_21_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_21_pad_0 = const()[name = tensor<string, []>("input_21_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_21_strides_0 = const()[name = tensor<string, []>("input_21_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_21_dilations_0 = const()[name = tensor<string, []>("input_21_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_21_groups_0 = const()[name = tensor<string, []>("input_21_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 64, 3, 3]> body_0_rdb2_conv1_weight_to_fp16 = const()[name = tensor<string, []>("body_0_rdb2_conv1_weight_to_fp16"), val = tensor<fp16, [32, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(484032)))];
            tensor<fp16, [32]> body_0_rdb2_conv1_bias_to_fp16 = const()[name = tensor<string, []>("body_0_rdb2_conv1_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(520960)))];
            tensor<fp16, [1, 32, 512, 512]> input_21_cast_fp16 = conv(bias = body_0_rdb2_conv1_bias_to_fp16, dilations = input_21_dilations_0, groups = input_21_groups_0, pad = input_21_pad_0, pad_type = input_21_pad_type_0, strides = input_21_strides_0, weight = body_0_rdb2_conv1_weight_to_fp16, x = input_19_cast_fp16)[name = tensor<string, []>("input_21_cast_fp16")];
            tensor<fp16, [1, 32, 512, 512]> x1_3_cast_fp16 = leaky_relu(alpha = var_20_to_fp16, x = input_21_cast_fp16)[name = tensor<string, []>("x1_3_cast_fp16")];
            tensor<bool, []> input_23_interleave_0 = const()[name = tensor<string, []>("input_23_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 96, 512, 512]> input_23_cast_fp16 = concat(axis = var_21, interleave = input_23_interleave_0, values = (input_19_cast_fp16, x1_3_cast_fp16))[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<string, []> input_25_pad_type_0 = const()[name = tensor<string, []>("input_25_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_25_pad_0 = const()[name = tensor<string, []>("input_25_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_25_strides_0 = const()[name = tensor<string, []>("input_25_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_25_dilations_0 = const()[name = tensor<string, []>("input_25_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_25_groups_0 = const()[name = tensor<string, []>("input_25_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 96, 3, 3]> body_0_rdb2_conv2_weight_to_fp16 = const()[name = tensor<string, []>("body_0_rdb2_conv2_weight_to_fp16"), val = tensor<fp16, [32, 96, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(521088)))];
            tensor<fp16, [32]> body_0_rdb2_conv2_bias_to_fp16 = const()[name = tensor<string, []>("body_0_rdb2_conv2_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(576448)))];
            tensor<fp16, [1, 32, 512, 512]> input_25_cast_fp16 = conv(bias = body_0_rdb2_conv2_bias_to_fp16, dilations = input_25_dilations_0, groups = input_25_groups_0, pad = input_25_pad_0, pad_type = input_25_pad_type_0, strides = input_25_strides_0, weight = body_0_rdb2_conv2_weight_to_fp16, x = input_23_cast_fp16)[name = tensor<string, []>("input_25_cast_fp16")];
            tensor<fp16, [1, 32, 512, 512]> x2_3_cast_fp16 = leaky_relu(alpha = var_20_to_fp16, x = input_25_cast_fp16)[name = tensor<string, []>("x2_3_cast_fp16")];
            tensor<bool, []> input_27_interleave_0 = const()[name = tensor<string, []>("input_27_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 128, 512, 512]> input_27_cast_fp16 = concat(axis = var_21, interleave = input_27_interleave_0, values = (input_19_cast_fp16, x1_3_cast_fp16, x2_3_cast_fp16))[name = tensor<string, []>("input_27_cast_fp16")];
            tensor<string, []> input_29_pad_type_0 = const()[name = tensor<string, []>("input_29_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_29_pad_0 = const()[name = tensor<string, []>("input_29_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_29_strides_0 = const()[name = tensor<string, []>("input_29_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_29_dilations_0 = const()[name = tensor<string, []>("input_29_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_29_groups_0 = const()[name = tensor<string, []>("input_29_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 128, 3, 3]> body_0_rdb2_conv3_weight_to_fp16 = const()[name = tensor<string, []>("body_0_rdb2_conv3_weight_to_fp16"), val = tensor<fp16, [32, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(576576)))];
            tensor<fp16, [32]> body_0_rdb2_conv3_bias_to_fp16 = const()[name = tensor<string, []>("body_0_rdb2_conv3_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(650368)))];
            tensor<fp16, [1, 32, 512, 512]> input_29_cast_fp16 = conv(bias = body_0_rdb2_conv3_bias_to_fp16, dilations = input_29_dilations_0, groups = input_29_groups_0, pad = input_29_pad_0, pad_type = input_29_pad_type_0, strides = input_29_strides_0, weight = body_0_rdb2_conv3_weight_to_fp16, x = input_27_cast_fp16)[name = tensor<string, []>("input_29_cast_fp16")];
            tensor<fp16, [1, 32, 512, 512]> x3_3_cast_fp16 = leaky_relu(alpha = var_20_to_fp16, x = input_29_cast_fp16)[name = tensor<string, []>("x3_3_cast_fp16")];
            tensor<bool, []> input_31_interleave_0 = const()[name = tensor<string, []>("input_31_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 160, 512, 512]> input_31_cast_fp16 = concat(axis = var_21, interleave = input_31_interleave_0, values = (input_19_cast_fp16, x1_3_cast_fp16, x2_3_cast_fp16, x3_3_cast_fp16))[name = tensor<string, []>("input_31_cast_fp16")];
            tensor<string, []> input_33_pad_type_0 = const()[name = tensor<string, []>("input_33_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_33_pad_0 = const()[name = tensor<string, []>("input_33_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_33_strides_0 = const()[name = tensor<string, []>("input_33_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_33_dilations_0 = const()[name = tensor<string, []>("input_33_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_33_groups_0 = const()[name = tensor<string, []>("input_33_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 160, 3, 3]> body_0_rdb2_conv4_weight_to_fp16 = const()[name = tensor<string, []>("body_0_rdb2_conv4_weight_to_fp16"), val = tensor<fp16, [32, 160, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(650496)))];
            tensor<fp16, [32]> body_0_rdb2_conv4_bias_to_fp16 = const()[name = tensor<string, []>("body_0_rdb2_conv4_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(742720)))];
            tensor<fp16, [1, 32, 512, 512]> input_33_cast_fp16 = conv(bias = body_0_rdb2_conv4_bias_to_fp16, dilations = input_33_dilations_0, groups = input_33_groups_0, pad = input_33_pad_0, pad_type = input_33_pad_type_0, strides = input_33_strides_0, weight = body_0_rdb2_conv4_weight_to_fp16, x = input_31_cast_fp16)[name = tensor<string, []>("input_33_cast_fp16")];
            tensor<fp16, [1, 32, 512, 512]> x4_3_cast_fp16 = leaky_relu(alpha = var_20_to_fp16, x = input_33_cast_fp16)[name = tensor<string, []>("x4_3_cast_fp16")];
            tensor<bool, []> input_35_interleave_0 = const()[name = tensor<string, []>("input_35_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 192, 512, 512]> input_35_cast_fp16 = concat(axis = var_21, interleave = input_35_interleave_0, values = (input_19_cast_fp16, x1_3_cast_fp16, x2_3_cast_fp16, x3_3_cast_fp16, x4_3_cast_fp16))[name = tensor<string, []>("input_35_cast_fp16")];
            tensor<string, []> x5_3_pad_type_0 = const()[name = tensor<string, []>("x5_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x5_3_pad_0 = const()[name = tensor<string, []>("x5_3_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> x5_3_strides_0 = const()[name = tensor<string, []>("x5_3_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> x5_3_dilations_0 = const()[name = tensor<string, []>("x5_3_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> x5_3_groups_0 = const()[name = tensor<string, []>("x5_3_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 192, 3, 3]> var_159_weight_0_to_fp16 = const()[name = tensor<string, []>("op_159_weight_0_to_fp16"), val = tensor<fp16, [64, 192, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(742848)))];
            tensor<fp16, [64]> var_159_bias_0_to_fp16 = const()[name = tensor<string, []>("op_159_bias_0_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(964096)))];
            tensor<fp16, [1, 64, 512, 512]> var_159_cast_fp16 = conv(bias = var_159_bias_0_to_fp16, dilations = x5_3_dilations_0, groups = x5_3_groups_0, pad = x5_3_pad_0, pad_type = x5_3_pad_type_0, strides = x5_3_strides_0, weight = var_159_weight_0_to_fp16, x = input_35_cast_fp16)[name = tensor<string, []>("op_159_cast_fp16")];
            tensor<fp16, [1, 64, 512, 512]> input_37_cast_fp16 = add(x = var_159_cast_fp16, y = input_19_cast_fp16)[name = tensor<string, []>("input_37_cast_fp16")];
            tensor<string, []> input_39_pad_type_0 = const()[name = tensor<string, []>("input_39_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_39_pad_0 = const()[name = tensor<string, []>("input_39_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_39_strides_0 = const()[name = tensor<string, []>("input_39_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_39_dilations_0 = const()[name = tensor<string, []>("input_39_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_39_groups_0 = const()[name = tensor<string, []>("input_39_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 64, 3, 3]> body_0_rdb3_conv1_weight_to_fp16 = const()[name = tensor<string, []>("body_0_rdb3_conv1_weight_to_fp16"), val = tensor<fp16, [32, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(964288)))];
            tensor<fp16, [32]> body_0_rdb3_conv1_bias_to_fp16 = const()[name = tensor<string, []>("body_0_rdb3_conv1_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1001216)))];
            tensor<fp16, [1, 32, 512, 512]> input_39_cast_fp16 = conv(bias = body_0_rdb3_conv1_bias_to_fp16, dilations = input_39_dilations_0, groups = input_39_groups_0, pad = input_39_pad_0, pad_type = input_39_pad_type_0, strides = input_39_strides_0, weight = body_0_rdb3_conv1_weight_to_fp16, x = input_37_cast_fp16)[name = tensor<string, []>("input_39_cast_fp16")];
            tensor<fp16, [1, 32, 512, 512]> x1_5_cast_fp16 = leaky_relu(alpha = var_20_to_fp16, x = input_39_cast_fp16)[name = tensor<string, []>("x1_5_cast_fp16")];
            tensor<bool, []> input_41_interleave_0 = const()[name = tensor<string, []>("input_41_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 96, 512, 512]> input_41_cast_fp16 = concat(axis = var_21, interleave = input_41_interleave_0, values = (input_37_cast_fp16, x1_5_cast_fp16))[name = tensor<string, []>("input_41_cast_fp16")];
            tensor<string, []> input_43_pad_type_0 = const()[name = tensor<string, []>("input_43_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_43_pad_0 = const()[name = tensor<string, []>("input_43_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_43_strides_0 = const()[name = tensor<string, []>("input_43_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_43_dilations_0 = const()[name = tensor<string, []>("input_43_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_43_groups_0 = const()[name = tensor<string, []>("input_43_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 96, 3, 3]> body_0_rdb3_conv2_weight_to_fp16 = const()[name = tensor<string, []>("body_0_rdb3_conv2_weight_to_fp16"), val = tensor<fp16, [32, 96, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1001344)))];
            tensor<fp16, [32]> body_0_rdb3_conv2_bias_to_fp16 = const()[name = tensor<string, []>("body_0_rdb3_conv2_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1056704)))];
            tensor<fp16, [1, 32, 512, 512]> input_43_cast_fp16 = conv(bias = body_0_rdb3_conv2_bias_to_fp16, dilations = input_43_dilations_0, groups = input_43_groups_0, pad = input_43_pad_0, pad_type = input_43_pad_type_0, strides = input_43_strides_0, weight = body_0_rdb3_conv2_weight_to_fp16, x = input_41_cast_fp16)[name = tensor<string, []>("input_43_cast_fp16")];
            tensor<fp16, [1, 32, 512, 512]> x2_5_cast_fp16 = leaky_relu(alpha = var_20_to_fp16, x = input_43_cast_fp16)[name = tensor<string, []>("x2_5_cast_fp16")];
            tensor<bool, []> input_45_interleave_0 = const()[name = tensor<string, []>("input_45_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 128, 512, 512]> input_45_cast_fp16 = concat(axis = var_21, interleave = input_45_interleave_0, values = (input_37_cast_fp16, x1_5_cast_fp16, x2_5_cast_fp16))[name = tensor<string, []>("input_45_cast_fp16")];
            tensor<string, []> input_47_pad_type_0 = const()[name = tensor<string, []>("input_47_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_47_pad_0 = const()[name = tensor<string, []>("input_47_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_47_strides_0 = const()[name = tensor<string, []>("input_47_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_47_dilations_0 = const()[name = tensor<string, []>("input_47_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_47_groups_0 = const()[name = tensor<string, []>("input_47_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 128, 3, 3]> body_0_rdb3_conv3_weight_to_fp16 = const()[name = tensor<string, []>("body_0_rdb3_conv3_weight_to_fp16"), val = tensor<fp16, [32, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1056832)))];
            tensor<fp16, [32]> body_0_rdb3_conv3_bias_to_fp16 = const()[name = tensor<string, []>("body_0_rdb3_conv3_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1130624)))];
            tensor<fp16, [1, 32, 512, 512]> input_47_cast_fp16 = conv(bias = body_0_rdb3_conv3_bias_to_fp16, dilations = input_47_dilations_0, groups = input_47_groups_0, pad = input_47_pad_0, pad_type = input_47_pad_type_0, strides = input_47_strides_0, weight = body_0_rdb3_conv3_weight_to_fp16, x = input_45_cast_fp16)[name = tensor<string, []>("input_47_cast_fp16")];
            tensor<fp16, [1, 32, 512, 512]> x3_5_cast_fp16 = leaky_relu(alpha = var_20_to_fp16, x = input_47_cast_fp16)[name = tensor<string, []>("x3_5_cast_fp16")];
            tensor<bool, []> input_49_interleave_0 = const()[name = tensor<string, []>("input_49_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 160, 512, 512]> input_49_cast_fp16 = concat(axis = var_21, interleave = input_49_interleave_0, values = (input_37_cast_fp16, x1_5_cast_fp16, x2_5_cast_fp16, x3_5_cast_fp16))[name = tensor<string, []>("input_49_cast_fp16")];
            tensor<string, []> input_51_pad_type_0 = const()[name = tensor<string, []>("input_51_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_51_pad_0 = const()[name = tensor<string, []>("input_51_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_51_strides_0 = const()[name = tensor<string, []>("input_51_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_51_dilations_0 = const()[name = tensor<string, []>("input_51_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_51_groups_0 = const()[name = tensor<string, []>("input_51_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 160, 3, 3]> body_0_rdb3_conv4_weight_to_fp16 = const()[name = tensor<string, []>("body_0_rdb3_conv4_weight_to_fp16"), val = tensor<fp16, [32, 160, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1130752)))];
            tensor<fp16, [32]> body_0_rdb3_conv4_bias_to_fp16 = const()[name = tensor<string, []>("body_0_rdb3_conv4_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1222976)))];
            tensor<fp16, [1, 32, 512, 512]> input_51_cast_fp16 = conv(bias = body_0_rdb3_conv4_bias_to_fp16, dilations = input_51_dilations_0, groups = input_51_groups_0, pad = input_51_pad_0, pad_type = input_51_pad_type_0, strides = input_51_strides_0, weight = body_0_rdb3_conv4_weight_to_fp16, x = input_49_cast_fp16)[name = tensor<string, []>("input_51_cast_fp16")];
            tensor<fp16, [1, 32, 512, 512]> x4_5_cast_fp16 = leaky_relu(alpha = var_20_to_fp16, x = input_51_cast_fp16)[name = tensor<string, []>("x4_5_cast_fp16")];
            tensor<bool, []> input_53_interleave_0 = const()[name = tensor<string, []>("input_53_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 192, 512, 512]> input_53_cast_fp16 = concat(axis = var_21, interleave = input_53_interleave_0, values = (input_37_cast_fp16, x1_5_cast_fp16, x2_5_cast_fp16, x3_5_cast_fp16, x4_5_cast_fp16))[name = tensor<string, []>("input_53_cast_fp16")];
            tensor<string, []> x5_5_pad_type_0 = const()[name = tensor<string, []>("x5_5_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x5_5_pad_0 = const()[name = tensor<string, []>("x5_5_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> x5_5_strides_0 = const()[name = tensor<string, []>("x5_5_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> x5_5_dilations_0 = const()[name = tensor<string, []>("x5_5_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> x5_5_groups_0 = const()[name = tensor<string, []>("x5_5_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 192, 3, 3]> var_214_weight_0_to_fp16 = const()[name = tensor<string, []>("op_214_weight_0_to_fp16"), val = tensor<fp16, [64, 192, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1223104)))];
            tensor<fp16, [64]> var_214_bias_0_to_fp16 = const()[name = tensor<string, []>("op_214_bias_0_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1444352)))];
            tensor<fp16, [1, 64, 512, 512]> var_214_cast_fp16 = conv(bias = var_214_bias_0_to_fp16, dilations = x5_5_dilations_0, groups = x5_5_groups_0, pad = x5_5_pad_0, pad_type = x5_5_pad_type_0, strides = x5_5_strides_0, weight = var_214_weight_0_to_fp16, x = input_53_cast_fp16)[name = tensor<string, []>("op_214_cast_fp16")];
            tensor<fp16, [1, 64, 512, 512]> out_1_cast_fp16 = add(x = var_214_cast_fp16, y = input_37_cast_fp16)[name = tensor<string, []>("out_1_cast_fp16")];
            tensor<fp16, []> var_216_to_fp16 = const()[name = tensor<string, []>("op_216_to_fp16"), val = tensor<fp16, []>(0x1.998p-3)];
            tensor<fp16, [1, 64, 512, 512]> var_217_cast_fp16 = mul(x = out_1_cast_fp16, y = var_216_to_fp16)[name = tensor<string, []>("op_217_cast_fp16")];
            tensor<fp16, [1, 64, 512, 512]> input_55_cast_fp16 = add(x = var_217_cast_fp16, y = input_1_cast_fp16)[name = tensor<string, []>("input_55_cast_fp16")];
            tensor<string, []> input_57_pad_type_0 = const()[name = tensor<string, []>("input_57_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_57_pad_0 = const()[name = tensor<string, []>("input_57_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_57_strides_0 = const()[name = tensor<string, []>("input_57_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_57_dilations_0 = const()[name = tensor<string, []>("input_57_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_57_groups_0 = const()[name = tensor<string, []>("input_57_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 64, 3, 3]> body_1_rdb1_conv1_weight_to_fp16 = const()[name = tensor<string, []>("body_1_rdb1_conv1_weight_to_fp16"), val = tensor<fp16, [32, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1444544)))];
            tensor<fp16, [32]> body_1_rdb1_conv1_bias_to_fp16 = const()[name = tensor<string, []>("body_1_rdb1_conv1_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1481472)))];
            tensor<fp16, [1, 32, 512, 512]> input_57_cast_fp16 = conv(bias = body_1_rdb1_conv1_bias_to_fp16, dilations = input_57_dilations_0, groups = input_57_groups_0, pad = input_57_pad_0, pad_type = input_57_pad_type_0, strides = input_57_strides_0, weight = body_1_rdb1_conv1_weight_to_fp16, x = input_55_cast_fp16)[name = tensor<string, []>("input_57_cast_fp16")];
            tensor<fp16, [1, 32, 512, 512]> x1_7_cast_fp16 = leaky_relu(alpha = var_20_to_fp16, x = input_57_cast_fp16)[name = tensor<string, []>("x1_7_cast_fp16")];
            tensor<bool, []> input_59_interleave_0 = const()[name = tensor<string, []>("input_59_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 96, 512, 512]> input_59_cast_fp16 = concat(axis = var_21, interleave = input_59_interleave_0, values = (input_55_cast_fp16, x1_7_cast_fp16))[name = tensor<string, []>("input_59_cast_fp16")];
            tensor<string, []> input_61_pad_type_0 = const()[name = tensor<string, []>("input_61_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_61_pad_0 = const()[name = tensor<string, []>("input_61_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_61_strides_0 = const()[name = tensor<string, []>("input_61_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_61_dilations_0 = const()[name = tensor<string, []>("input_61_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_61_groups_0 = const()[name = tensor<string, []>("input_61_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 96, 3, 3]> body_1_rdb1_conv2_weight_to_fp16 = const()[name = tensor<string, []>("body_1_rdb1_conv2_weight_to_fp16"), val = tensor<fp16, [32, 96, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1481600)))];
            tensor<fp16, [32]> body_1_rdb1_conv2_bias_to_fp16 = const()[name = tensor<string, []>("body_1_rdb1_conv2_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1536960)))];
            tensor<fp16, [1, 32, 512, 512]> input_61_cast_fp16 = conv(bias = body_1_rdb1_conv2_bias_to_fp16, dilations = input_61_dilations_0, groups = input_61_groups_0, pad = input_61_pad_0, pad_type = input_61_pad_type_0, strides = input_61_strides_0, weight = body_1_rdb1_conv2_weight_to_fp16, x = input_59_cast_fp16)[name = tensor<string, []>("input_61_cast_fp16")];
            tensor<fp16, [1, 32, 512, 512]> x2_7_cast_fp16 = leaky_relu(alpha = var_20_to_fp16, x = input_61_cast_fp16)[name = tensor<string, []>("x2_7_cast_fp16")];
            tensor<bool, []> input_63_interleave_0 = const()[name = tensor<string, []>("input_63_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 128, 512, 512]> input_63_cast_fp16 = concat(axis = var_21, interleave = input_63_interleave_0, values = (input_55_cast_fp16, x1_7_cast_fp16, x2_7_cast_fp16))[name = tensor<string, []>("input_63_cast_fp16")];
            tensor<string, []> input_65_pad_type_0 = const()[name = tensor<string, []>("input_65_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_65_pad_0 = const()[name = tensor<string, []>("input_65_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_65_strides_0 = const()[name = tensor<string, []>("input_65_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_65_dilations_0 = const()[name = tensor<string, []>("input_65_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_65_groups_0 = const()[name = tensor<string, []>("input_65_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 128, 3, 3]> body_1_rdb1_conv3_weight_to_fp16 = const()[name = tensor<string, []>("body_1_rdb1_conv3_weight_to_fp16"), val = tensor<fp16, [32, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1537088)))];
            tensor<fp16, [32]> body_1_rdb1_conv3_bias_to_fp16 = const()[name = tensor<string, []>("body_1_rdb1_conv3_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1610880)))];
            tensor<fp16, [1, 32, 512, 512]> input_65_cast_fp16 = conv(bias = body_1_rdb1_conv3_bias_to_fp16, dilations = input_65_dilations_0, groups = input_65_groups_0, pad = input_65_pad_0, pad_type = input_65_pad_type_0, strides = input_65_strides_0, weight = body_1_rdb1_conv3_weight_to_fp16, x = input_63_cast_fp16)[name = tensor<string, []>("input_65_cast_fp16")];
            tensor<fp16, [1, 32, 512, 512]> x3_7_cast_fp16 = leaky_relu(alpha = var_20_to_fp16, x = input_65_cast_fp16)[name = tensor<string, []>("x3_7_cast_fp16")];
            tensor<bool, []> input_67_interleave_0 = const()[name = tensor<string, []>("input_67_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 160, 512, 512]> input_67_cast_fp16 = concat(axis = var_21, interleave = input_67_interleave_0, values = (input_55_cast_fp16, x1_7_cast_fp16, x2_7_cast_fp16, x3_7_cast_fp16))[name = tensor<string, []>("input_67_cast_fp16")];
            tensor<string, []> input_69_pad_type_0 = const()[name = tensor<string, []>("input_69_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_69_pad_0 = const()[name = tensor<string, []>("input_69_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_69_strides_0 = const()[name = tensor<string, []>("input_69_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_69_dilations_0 = const()[name = tensor<string, []>("input_69_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_69_groups_0 = const()[name = tensor<string, []>("input_69_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 160, 3, 3]> body_1_rdb1_conv4_weight_to_fp16 = const()[name = tensor<string, []>("body_1_rdb1_conv4_weight_to_fp16"), val = tensor<fp16, [32, 160, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1611008)))];
            tensor<fp16, [32]> body_1_rdb1_conv4_bias_to_fp16 = const()[name = tensor<string, []>("body_1_rdb1_conv4_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1703232)))];
            tensor<fp16, [1, 32, 512, 512]> input_69_cast_fp16 = conv(bias = body_1_rdb1_conv4_bias_to_fp16, dilations = input_69_dilations_0, groups = input_69_groups_0, pad = input_69_pad_0, pad_type = input_69_pad_type_0, strides = input_69_strides_0, weight = body_1_rdb1_conv4_weight_to_fp16, x = input_67_cast_fp16)[name = tensor<string, []>("input_69_cast_fp16")];
            tensor<fp16, [1, 32, 512, 512]> x4_7_cast_fp16 = leaky_relu(alpha = var_20_to_fp16, x = input_69_cast_fp16)[name = tensor<string, []>("x4_7_cast_fp16")];
            tensor<bool, []> input_71_interleave_0 = const()[name = tensor<string, []>("input_71_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 192, 512, 512]> input_71_cast_fp16 = concat(axis = var_21, interleave = input_71_interleave_0, values = (input_55_cast_fp16, x1_7_cast_fp16, x2_7_cast_fp16, x3_7_cast_fp16, x4_7_cast_fp16))[name = tensor<string, []>("input_71_cast_fp16")];
            tensor<string, []> x5_7_pad_type_0 = const()[name = tensor<string, []>("x5_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x5_7_pad_0 = const()[name = tensor<string, []>("x5_7_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> x5_7_strides_0 = const()[name = tensor<string, []>("x5_7_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> x5_7_dilations_0 = const()[name = tensor<string, []>("x5_7_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> x5_7_groups_0 = const()[name = tensor<string, []>("x5_7_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 192, 3, 3]> var_275_weight_0_to_fp16 = const()[name = tensor<string, []>("op_275_weight_0_to_fp16"), val = tensor<fp16, [64, 192, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1703360)))];
            tensor<fp16, [64]> var_275_bias_0_to_fp16 = const()[name = tensor<string, []>("op_275_bias_0_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1924608)))];
            tensor<fp16, [1, 64, 512, 512]> var_275_cast_fp16 = conv(bias = var_275_bias_0_to_fp16, dilations = x5_7_dilations_0, groups = x5_7_groups_0, pad = x5_7_pad_0, pad_type = x5_7_pad_type_0, strides = x5_7_strides_0, weight = var_275_weight_0_to_fp16, x = input_71_cast_fp16)[name = tensor<string, []>("op_275_cast_fp16")];
            tensor<fp16, [1, 64, 512, 512]> input_73_cast_fp16 = add(x = var_275_cast_fp16, y = input_55_cast_fp16)[name = tensor<string, []>("input_73_cast_fp16")];
            tensor<string, []> input_75_pad_type_0 = const()[name = tensor<string, []>("input_75_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_75_pad_0 = const()[name = tensor<string, []>("input_75_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_75_strides_0 = const()[name = tensor<string, []>("input_75_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_75_dilations_0 = const()[name = tensor<string, []>("input_75_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_75_groups_0 = const()[name = tensor<string, []>("input_75_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 64, 3, 3]> body_1_rdb2_conv1_weight_to_fp16 = const()[name = tensor<string, []>("body_1_rdb2_conv1_weight_to_fp16"), val = tensor<fp16, [32, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1924800)))];
            tensor<fp16, [32]> body_1_rdb2_conv1_bias_to_fp16 = const()[name = tensor<string, []>("body_1_rdb2_conv1_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1961728)))];
            tensor<fp16, [1, 32, 512, 512]> input_75_cast_fp16 = conv(bias = body_1_rdb2_conv1_bias_to_fp16, dilations = input_75_dilations_0, groups = input_75_groups_0, pad = input_75_pad_0, pad_type = input_75_pad_type_0, strides = input_75_strides_0, weight = body_1_rdb2_conv1_weight_to_fp16, x = input_73_cast_fp16)[name = tensor<string, []>("input_75_cast_fp16")];
            tensor<fp16, [1, 32, 512, 512]> x1_9_cast_fp16 = leaky_relu(alpha = var_20_to_fp16, x = input_75_cast_fp16)[name = tensor<string, []>("x1_9_cast_fp16")];
            tensor<bool, []> input_77_interleave_0 = const()[name = tensor<string, []>("input_77_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 96, 512, 512]> input_77_cast_fp16 = concat(axis = var_21, interleave = input_77_interleave_0, values = (input_73_cast_fp16, x1_9_cast_fp16))[name = tensor<string, []>("input_77_cast_fp16")];
            tensor<string, []> input_79_pad_type_0 = const()[name = tensor<string, []>("input_79_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_79_pad_0 = const()[name = tensor<string, []>("input_79_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_79_strides_0 = const()[name = tensor<string, []>("input_79_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_79_dilations_0 = const()[name = tensor<string, []>("input_79_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_79_groups_0 = const()[name = tensor<string, []>("input_79_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 96, 3, 3]> body_1_rdb2_conv2_weight_to_fp16 = const()[name = tensor<string, []>("body_1_rdb2_conv2_weight_to_fp16"), val = tensor<fp16, [32, 96, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1961856)))];
            tensor<fp16, [32]> body_1_rdb2_conv2_bias_to_fp16 = const()[name = tensor<string, []>("body_1_rdb2_conv2_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2017216)))];
            tensor<fp16, [1, 32, 512, 512]> input_79_cast_fp16 = conv(bias = body_1_rdb2_conv2_bias_to_fp16, dilations = input_79_dilations_0, groups = input_79_groups_0, pad = input_79_pad_0, pad_type = input_79_pad_type_0, strides = input_79_strides_0, weight = body_1_rdb2_conv2_weight_to_fp16, x = input_77_cast_fp16)[name = tensor<string, []>("input_79_cast_fp16")];
            tensor<fp16, [1, 32, 512, 512]> x2_9_cast_fp16 = leaky_relu(alpha = var_20_to_fp16, x = input_79_cast_fp16)[name = tensor<string, []>("x2_9_cast_fp16")];
            tensor<bool, []> input_81_interleave_0 = const()[name = tensor<string, []>("input_81_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 128, 512, 512]> input_81_cast_fp16 = concat(axis = var_21, interleave = input_81_interleave_0, values = (input_73_cast_fp16, x1_9_cast_fp16, x2_9_cast_fp16))[name = tensor<string, []>("input_81_cast_fp16")];
            tensor<string, []> input_83_pad_type_0 = const()[name = tensor<string, []>("input_83_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_83_pad_0 = const()[name = tensor<string, []>("input_83_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_83_strides_0 = const()[name = tensor<string, []>("input_83_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_83_dilations_0 = const()[name = tensor<string, []>("input_83_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_83_groups_0 = const()[name = tensor<string, []>("input_83_groups_0"), val = tensor<int32, []>(1)];
