program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3520.4.1"}, {"coremlc-version", "3520.5.1"}, {"coremltools-component-torch", "2.12.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0"}})]
{
    func main<ios16>(tensor<fp16, [1, 3, 512, 512]> input) {
            tensor<uint32, []> input_1_downscale_factor_0 = const()[name = tensor<string, []>("input_1_downscale_factor_0"), val = tensor<uint32, []>(2)];
            tensor<fp16, [1, 12, 256, 256]> input_1_cast_fp16 = pixel_unshuffle(downscale_factor = input_1_downscale_factor_0, x = input)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<int32, []> var_8 = const()[name = tensor<string, []>("op_8"), val = tensor<int32, []>(1)];
            tensor<string, []> input_3_pad_type_0 = const()[name = tensor<string, []>("input_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_3_pad_0 = const()[name = tensor<string, []>("input_3_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_3_strides_0 = const()[name = tensor<string, []>("input_3_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_3_dilations_0 = const()[name = tensor<string, []>("input_3_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_3_groups_0 = const()[name = tensor<string, []>("input_3_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 12, 3, 3]> rrdb_conv_first_weight_to_fp16 = const()[name = tensor<string, []>("rrdb_conv_first_weight_to_fp16"), val = tensor<fp16, [64, 12, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [64]> rrdb_conv_first_bias_to_fp16 = const()[name = tensor<string, []>("rrdb_conv_first_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13952)))];
            tensor<fp16, [1, 64, 256, 256]> input_3_cast_fp16 = conv(bias = rrdb_conv_first_bias_to_fp16, dilations = input_3_dilations_0, groups = input_3_groups_0, pad = input_3_pad_0, pad_type = input_3_pad_type_0, strides = input_3_strides_0, weight = rrdb_conv_first_weight_to_fp16, x = input_1_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<string, []> input_5_pad_type_0 = const()[name = tensor<string, []>("input_5_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_5_pad_0 = const()[name = tensor<string, []>("input_5_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_5_strides_0 = const()[name = tensor<string, []>("input_5_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_5_dilations_0 = const()[name = tensor<string, []>("input_5_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_5_groups_0 = const()[name = tensor<string, []>("input_5_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 64, 3, 3]> rrdb_body_0_rdb1_conv1_weight_to_fp16 = const()[name = tensor<string, []>("rrdb_body_0_rdb1_conv1_weight_to_fp16"), val = tensor<fp16, [32, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14144)))];
            tensor<fp16, [32]> rrdb_body_0_rdb1_conv1_bias_to_fp16 = const()[name = tensor<string, []>("rrdb_body_0_rdb1_conv1_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(51072)))];
            tensor<fp16, [1, 32, 256, 256]> input_5_cast_fp16 = conv(bias = rrdb_body_0_rdb1_conv1_bias_to_fp16, dilations = input_5_dilations_0, groups = input_5_groups_0, pad = input_5_pad_0, pad_type = input_5_pad_type_0, strides = input_5_strides_0, weight = rrdb_body_0_rdb1_conv1_weight_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<fp16, []> var_7_to_fp16 = const()[name = tensor<string, []>("op_7_to_fp16"), val = tensor<fp16, []>(0x1.998p-3)];
            tensor<fp16, [1, 32, 256, 256]> x1_1_cast_fp16 = leaky_relu(alpha = var_7_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("x1_1_cast_fp16")];
            tensor<bool, []> input_7_interleave_0 = const()[name = tensor<string, []>("input_7_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 96, 256, 256]> input_7_cast_fp16 = concat(axis = var_8, interleave = input_7_interleave_0, values = (input_3_cast_fp16, x1_1_cast_fp16))[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<string, []> input_9_pad_type_0 = const()[name = tensor<string, []>("input_9_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_9_pad_0 = const()[name = tensor<string, []>("input_9_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_9_strides_0 = const()[name = tensor<string, []>("input_9_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_9_dilations_0 = const()[name = tensor<string, []>("input_9_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_9_groups_0 = const()[name = tensor<string, []>("input_9_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 96, 3, 3]> rrdb_body_0_rdb1_conv2_weight_to_fp16 = const()[name = tensor<string, []>("rrdb_body_0_rdb1_conv2_weight_to_fp16"), val = tensor<fp16, [32, 96, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(51200)))];
            tensor<fp16, [32]> rrdb_body_0_rdb1_conv2_bias_to_fp16 = const()[name = tensor<string, []>("rrdb_body_0_rdb1_conv2_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(106560)))];
            tensor<fp16, [1, 32, 256, 256]> input_9_cast_fp16 = conv(bias = rrdb_body_0_rdb1_conv2_bias_to_fp16, dilations = input_9_dilations_0, groups = input_9_groups_0, pad = input_9_pad_0, pad_type = input_9_pad_type_0, strides = input_9_strides_0, weight = rrdb_body_0_rdb1_conv2_weight_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<fp16, [1, 32, 256, 256]> x2_1_cast_fp16 = leaky_relu(alpha = var_7_to_fp16, x = input_9_cast_fp16)[name = tensor<string, []>("x2_1_cast_fp16")];
            tensor<bool, []> input_11_interleave_0 = const()[name = tensor<string, []>("input_11_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 128, 256, 256]> input_11_cast_fp16 = concat(axis = var_8, interleave = input_11_interleave_0, values = (input_3_cast_fp16, x1_1_cast_fp16, x2_1_cast_fp16))[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<string, []> input_13_pad_type_0 = const()[name = tensor<string, []>("input_13_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_13_pad_0 = const()[name = tensor<string, []>("input_13_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_13_strides_0 = const()[name = tensor<string, []>("input_13_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_13_dilations_0 = const()[name = tensor<string, []>("input_13_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_13_groups_0 = const()[name = tensor<string, []>("input_13_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 128, 3, 3]> rrdb_body_0_rdb1_conv3_weight_to_fp16 = const()[name = tensor<string, []>("rrdb_body_0_rdb1_conv3_weight_to_fp16"), val = tensor<fp16, [32, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(106688)))];
            tensor<fp16, [32]> rrdb_body_0_rdb1_conv3_bias_to_fp16 = const()[name = tensor<string, []>("rrdb_body_0_rdb1_conv3_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(180480)))];
            tensor<fp16, [1, 32, 256, 256]> input_13_cast_fp16 = conv(bias = rrdb_body_0_rdb1_conv3_bias_to_fp16, dilations = input_13_dilations_0, groups = input_13_groups_0, pad = input_13_pad_0, pad_type = input_13_pad_type_0, strides = input_13_strides_0, weight = rrdb_body_0_rdb1_conv3_weight_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<fp16, [1, 32, 256, 256]> x3_1_cast_fp16 = leaky_relu(alpha = var_7_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("x3_1_cast_fp16")];
            tensor<bool, []> input_15_interleave_0 = const()[name = tensor<string, []>("input_15_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 160, 256, 256]> input_15_cast_fp16 = concat(axis = var_8, interleave = input_15_interleave_0, values = (input_3_cast_fp16, x1_1_cast_fp16, x2_1_cast_fp16, x3_1_cast_fp16))[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<string, []> input_17_pad_type_0 = const()[name = tensor<string, []>("input_17_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_17_pad_0 = const()[name = tensor<string, []>("input_17_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_17_strides_0 = const()[name = tensor<string, []>("input_17_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_17_dilations_0 = const()[name = tensor<string, []>("input_17_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_17_groups_0 = const()[name = tensor<string, []>("input_17_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 160, 3, 3]> rrdb_body_0_rdb1_conv4_weight_to_fp16 = const()[name = tensor<string, []>("rrdb_body_0_rdb1_conv4_weight_to_fp16"), val = tensor<fp16, [32, 160, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(180608)))];
            tensor<fp16, [32]> rrdb_body_0_rdb1_conv4_bias_to_fp16 = const()[name = tensor<string, []>("rrdb_body_0_rdb1_conv4_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(272832)))];
            tensor<fp16, [1, 32, 256, 256]> input_17_cast_fp16 = conv(bias = rrdb_body_0_rdb1_conv4_bias_to_fp16, dilations = input_17_dilations_0, groups = input_17_groups_0, pad = input_17_pad_0, pad_type = input_17_pad_type_0, strides = input_17_strides_0, weight = rrdb_body_0_rdb1_conv4_weight_to_fp16, x = input_15_cast_fp16)[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<fp16, [1, 32, 256, 256]> x4_1_cast_fp16 = leaky_relu(alpha = var_7_to_fp16, x = input_17_cast_fp16)[name = tensor<string, []>("x4_1_cast_fp16")];
            tensor<bool, []> input_19_interleave_0 = const()[name = tensor<string, []>("input_19_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 192, 256, 256]> input_19_cast_fp16 = concat(axis = var_8, interleave = input_19_interleave_0, values = (input_3_cast_fp16, x1_1_cast_fp16, x2_1_cast_fp16, x3_1_cast_fp16, x4_1_cast_fp16))[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<string, []> x5_1_pad_type_0 = const()[name = tensor<string, []>("x5_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x5_1_pad_0 = const()[name = tensor<string, []>("x5_1_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> x5_1_strides_0 = const()[name = tensor<string, []>("x5_1_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> x5_1_dilations_0 = const()[name = tensor<string, []>("x5_1_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> x5_1_groups_0 = const()[name = tensor<string, []>("x5_1_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 192, 3, 3]> var_105_weight_0_to_fp16 = const()[name = tensor<string, []>("op_105_weight_0_to_fp16"), val = tensor<fp16, [64, 192, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(272960)))];
            tensor<fp16, [64]> var_105_bias_0_to_fp16 = const()[name = tensor<string, []>("op_105_bias_0_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(494208)))];
            tensor<fp16, [1, 64, 256, 256]> var_105_cast_fp16 = conv(bias = var_105_bias_0_to_fp16, dilations = x5_1_dilations_0, groups = x5_1_groups_0, pad = x5_1_pad_0, pad_type = x5_1_pad_type_0, strides = x5_1_strides_0, weight = var_105_weight_0_to_fp16, x = input_19_cast_fp16)[name = tensor<string, []>("op_105_cast_fp16")];
            tensor<fp16, [1, 64, 256, 256]> input_21_cast_fp16 = add(x = var_105_cast_fp16, y = input_3_cast_fp16)[name = tensor<string, []>("input_21_cast_fp16")];
            tensor<string, []> input_23_pad_type_0 = const()[name = tensor<string, []>("input_23_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_23_pad_0 = const()[name = tensor<string, []>("input_23_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_23_strides_0 = const()[name = tensor<string, []>("input_23_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_23_dilations_0 = const()[name = tensor<string, []>("input_23_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_23_groups_0 = const()[name = tensor<string, []>("input_23_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 64, 3, 3]> rrdb_body_0_rdb2_conv1_weight_to_fp16 = const()[name = tensor<string, []>("rrdb_body_0_rdb2_conv1_weight_to_fp16"), val = tensor<fp16, [32, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(494400)))];
            tensor<fp16, [32]> rrdb_body_0_rdb2_conv1_bias_to_fp16 = const()[name = tensor<string, []>("rrdb_body_0_rdb2_conv1_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(531328)))];
            tensor<fp16, [1, 32, 256, 256]> input_23_cast_fp16 = conv(bias = rrdb_body_0_rdb2_conv1_bias_to_fp16, dilations = input_23_dilations_0, groups = input_23_groups_0, pad = input_23_pad_0, pad_type = input_23_pad_type_0, strides = input_23_strides_0, weight = rrdb_body_0_rdb2_conv1_weight_to_fp16, x = input_21_cast_fp16)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<fp16, [1, 32, 256, 256]> x1_3_cast_fp16 = leaky_relu(alpha = var_7_to_fp16, x = input_23_cast_fp16)[name = tensor<string, []>("x1_3_cast_fp16")];
            tensor<bool, []> input_25_interleave_0 = const()[name = tensor<string, []>("input_25_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 96, 256, 256]> input_25_cast_fp16 = concat(axis = var_8, interleave = input_25_interleave_0, values = (input_21_cast_fp16, x1_3_cast_fp16))[name = tensor<string, []>("input_25_cast_fp16")];
            tensor<string, []> input_27_pad_type_0 = const()[name = tensor<string, []>("input_27_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_27_pad_0 = const()[name = tensor<string, []>("input_27_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_27_strides_0 = const()[name = tensor<string, []>("input_27_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_27_dilations_0 = const()[name = tensor<string, []>("input_27_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_27_groups_0 = const()[name = tensor<string, []>("input_27_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 96, 3, 3]> rrdb_body_0_rdb2_conv2_weight_to_fp16 = const()[name = tensor<string, []>("rrdb_body_0_rdb2_conv2_weight_to_fp16"), val = tensor<fp16, [32, 96, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(531456)))];
            tensor<fp16, [32]> rrdb_body_0_rdb2_conv2_bias_to_fp16 = const()[name = tensor<string, []>("rrdb_body_0_rdb2_conv2_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(586816)))];
            tensor<fp16, [1, 32, 256, 256]> input_27_cast_fp16 = conv(bias = rrdb_body_0_rdb2_conv2_bias_to_fp16, dilations = input_27_dilations_0, groups = input_27_groups_0, pad = input_27_pad_0, pad_type = input_27_pad_type_0, strides = input_27_strides_0, weight = rrdb_body_0_rdb2_conv2_weight_to_fp16, x = input_25_cast_fp16)[name = tensor<string, []>("input_27_cast_fp16")];
            tensor<fp16, [1, 32, 256, 256]> x2_3_cast_fp16 = leaky_relu(alpha = var_7_to_fp16, x = input_27_cast_fp16)[name = tensor<string, []>("x2_3_cast_fp16")];
            tensor<bool, []> input_29_interleave_0 = const()[name = tensor<string, []>("input_29_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 128, 256, 256]> input_29_cast_fp16 = concat(axis = var_8, interleave = input_29_interleave_0, values = (input_21_cast_fp16, x1_3_cast_fp16, x2_3_cast_fp16))[name = tensor<string, []>("input_29_cast_fp16")];
            tensor<string, []> input_31_pad_type_0 = const()[name = tensor<string, []>("input_31_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_31_pad_0 = const()[name = tensor<string, []>("input_31_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_31_strides_0 = const()[name = tensor<string, []>("input_31_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_31_dilations_0 = const()[name = tensor<string, []>("input_31_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_31_groups_0 = const()[name = tensor<string, []>("input_31_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 128, 3, 3]> rrdb_body_0_rdb2_conv3_weight_to_fp16 = const()[name = tensor<string, []>("rrdb_body_0_rdb2_conv3_weight_to_fp16"), val = tensor<fp16, [32, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(586944)))];
            tensor<fp16, [32]> rrdb_body_0_rdb2_conv3_bias_to_fp16 = const()[name = tensor<string, []>("rrdb_body_0_rdb2_conv3_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(660736)))];
            tensor<fp16, [1, 32, 256, 256]> input_31_cast_fp16 = conv(bias = rrdb_body_0_rdb2_conv3_bias_to_fp16, dilations = input_31_dilations_0, groups = input_31_groups_0, pad = input_31_pad_0, pad_type = input_31_pad_type_0, strides = input_31_strides_0, weight = rrdb_body_0_rdb2_conv3_weight_to_fp16, x = input_29_cast_fp16)[name = tensor<string, []>("input_31_cast_fp16")];
            tensor<fp16, [1, 32, 256, 256]> x3_3_cast_fp16 = leaky_relu(alpha = var_7_to_fp16, x = input_31_cast_fp16)[name = tensor<string, []>("x3_3_cast_fp16")];
            tensor<bool, []> input_33_interleave_0 = const()[name = tensor<string, []>("input_33_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 160, 256, 256]> input_33_cast_fp16 = concat(axis = var_8, interleave = input_33_interleave_0, values = (input_21_cast_fp16, x1_3_cast_fp16, x2_3_cast_fp16, x3_3_cast_fp16))[name = tensor<string, []>("input_33_cast_fp16")];
            tensor<string, []> input_35_pad_type_0 = const()[name = tensor<string, []>("input_35_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_35_pad_0 = const()[name = tensor<string, []>("input_35_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_35_strides_0 = const()[name = tensor<string, []>("input_35_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_35_dilations_0 = const()[name = tensor<string, []>("input_35_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_35_groups_0 = const()[name = tensor<string, []>("input_35_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 160, 3, 3]> rrdb_body_0_rdb2_conv4_weight_to_fp16 = const()[name = tensor<string, []>("rrdb_body_0_rdb2_conv4_weight_to_fp16"), val = tensor<fp16, [32, 160, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(660864)))];
            tensor<fp16, [32]> rrdb_body_0_rdb2_conv4_bias_to_fp16 = const()[name = tensor<string, []>("rrdb_body_0_rdb2_conv4_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(753088)))];
            tensor<fp16, [1, 32, 256, 256]> input_35_cast_fp16 = conv(bias = rrdb_body_0_rdb2_conv4_bias_to_fp16, dilations = input_35_dilations_0, groups = input_35_groups_0, pad = input_35_pad_0, pad_type = input_35_pad_type_0, strides = input_35_strides_0, weight = rrdb_body_0_rdb2_conv4_weight_to_fp16, x = input_33_cast_fp16)[name = tensor<string, []>("input_35_cast_fp16")];
            tensor<fp16, [1, 32, 256, 256]> x4_3_cast_fp16 = leaky_relu(alpha = var_7_to_fp16, x = input_35_cast_fp16)[name = tensor<string, []>("x4_3_cast_fp16")];
            tensor<bool, []> input_37_interleave_0 = const()[name = tensor<string, []>("input_37_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 192, 256, 256]> input_37_cast_fp16 = concat(axis = var_8, interleave = input_37_interleave_0, values = (input_21_cast_fp16, x1_3_cast_fp16, x2_3_cast_fp16, x3_3_cast_fp16, x4_3_cast_fp16))[name = tensor<string, []>("input_37_cast_fp16")];
            tensor<string, []> x5_3_pad_type_0 = const()[name = tensor<string, []>("x5_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x5_3_pad_0 = const()[name = tensor<string, []>("x5_3_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> x5_3_strides_0 = const()[name = tensor<string, []>("x5_3_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> x5_3_dilations_0 = const()[name = tensor<string, []>("x5_3_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> x5_3_groups_0 = const()[name = tensor<string, []>("x5_3_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 192, 3, 3]> var_160_weight_0_to_fp16 = const()[name = tensor<string, []>("op_160_weight_0_to_fp16"), val = tensor<fp16, [64, 192, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(753216)))];
            tensor<fp16, [64]> var_160_bias_0_to_fp16 = const()[name = tensor<string, []>("op_160_bias_0_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(974464)))];
            tensor<fp16, [1, 64, 256, 256]> var_160_cast_fp16 = conv(bias = var_160_bias_0_to_fp16, dilations = x5_3_dilations_0, groups = x5_3_groups_0, pad = x5_3_pad_0, pad_type = x5_3_pad_type_0, strides = x5_3_strides_0, weight = var_160_weight_0_to_fp16, x = input_37_cast_fp16)[name = tensor<string, []>("op_160_cast_fp16")];
            tensor<fp16, [1, 64, 256, 256]> input_39_cast_fp16 = add(x = var_160_cast_fp16, y = input_21_cast_fp16)[name = tensor<string, []>("input_39_cast_fp16")];
            tensor<string, []> input_41_pad_type_0 = const()[name = tensor<string, []>("input_41_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_41_pad_0 = const()[name = tensor<string, []>("input_41_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_41_strides_0 = const()[name = tensor<string, []>("input_41_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_41_dilations_0 = const()[name = tensor<string, []>("input_41_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_41_groups_0 = const()[name = tensor<string, []>("input_41_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 64, 3, 3]> rrdb_body_0_rdb3_conv1_weight_to_fp16 = const()[name = tensor<string, []>("rrdb_body_0_rdb3_conv1_weight_to_fp16"), val = tensor<fp16, [32, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(974656)))];
            tensor<fp16, [32]> rrdb_body_0_rdb3_conv1_bias_to_fp16 = const()[name = tensor<string, []>("rrdb_body_0_rdb3_conv1_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1011584)))];
            tensor<fp16, [1, 32, 256, 256]> input_41_cast_fp16 = conv(bias = rrdb_body_0_rdb3_conv1_bias_to_fp16, dilations = input_41_dilations_0, groups = input_41_groups_0, pad = input_41_pad_0, pad_type = input_41_pad_type_0, strides = input_41_strides_0, weight = rrdb_body_0_rdb3_conv1_weight_to_fp16, x = input_39_cast_fp16)[name = tensor<string, []>("input_41_cast_fp16")];
            tensor<fp16, [1, 32, 256, 256]> x1_5_cast_fp16 = leaky_relu(alpha = var_7_to_fp16, x = input_41_cast_fp16)[name = tensor<string, []>("x1_5_cast_fp16")];
            tensor<bool, []> input_43_interleave_0 = const()[name = tensor<string, []>("input_43_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 96, 256, 256]> input_43_cast_fp16 = concat(axis = var_8, interleave = input_43_interleave_0, values = (input_39_cast_fp16, x1_5_cast_fp16))[name = tensor<string, []>("input_43_cast_fp16")];
            tensor<string, []> input_45_pad_type_0 = const()[name = tensor<string, []>("input_45_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_45_pad_0 = const()[name = tensor<string, []>("input_45_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_45_strides_0 = const()[name = tensor<string, []>("input_45_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_45_dilations_0 = const()[name = tensor<string, []>("input_45_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_45_groups_0 = const()[name = tensor<string, []>("input_45_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 96, 3, 3]> rrdb_body_0_rdb3_conv2_weight_to_fp16 = const()[name = tensor<string, []>("rrdb_body_0_rdb3_conv2_weight_to_fp16"), val = tensor<fp16, [32, 96, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1011712)))];
            tensor<fp16, [32]> rrdb_body_0_rdb3_conv2_bias_to_fp16 = const()[name = tensor<string, []>("rrdb_body_0_rdb3_conv2_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1067072)))];
            tensor<fp16, [1, 32, 256, 256]> input_45_cast_fp16 = conv(bias = rrdb_body_0_rdb3_conv2_bias_to_fp16, dilations = input_45_dilations_0, groups = input_45_groups_0, pad = input_45_pad_0, pad_type = input_45_pad_type_0, strides = input_45_strides_0, weight = rrdb_body_0_rdb3_conv2_weight_to_fp16, x = input_43_cast_fp16)[name = tensor<string, []>("input_45_cast_fp16")];
            tensor<fp16, [1, 32, 256, 256]> x2_5_cast_fp16 = leaky_relu(alpha = var_7_to_fp16, x = input_45_cast_fp16)[name = tensor<string, []>("x2_5_cast_fp16")];
            tensor<bool, []> input_47_interleave_0 = const()[name = tensor<string, []>("input_47_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 128, 256, 256]> input_47_cast_fp16 = concat(axis = var_8, interleave = input_47_interleave_0, values = (input_39_cast_fp16, x1_5_cast_fp16, x2_5_cast_fp16))[name = tensor<string, []>("input_47_cast_fp16")];
            tensor<string, []> input_49_pad_type_0 = const()[name = tensor<string, []>("input_49_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_49_pad_0 = const()[name = tensor<string, []>("input_49_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_49_strides_0 = const()[name = tensor<string, []>("input_49_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_49_dilations_0 = const()[name = tensor<string, []>("input_49_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_49_groups_0 = const()[name = tensor<string, []>("input_49_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 128, 3, 3]> rrdb_body_0_rdb3_conv3_weight_to_fp16 = const()[name = tensor<string, []>("rrdb_body_0_rdb3_conv3_weight_to_fp16"), val = tensor<fp16, [32, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1067200)))];
            tensor<fp16, [32]> rrdb_body_0_rdb3_conv3_bias_to_fp16 = const()[name = tensor<string, []>("rrdb_body_0_rdb3_conv3_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1140992)))];
            tensor<fp16, [1, 32, 256, 256]> input_49_cast_fp16 = conv(bias = rrdb_body_0_rdb3_conv3_bias_to_fp16, dilations = input_49_dilations_0, groups = input_49_groups_0, pad = input_49_pad_0, pad_type = input_49_pad_type_0, strides = input_49_strides_0, weight = rrdb_body_0_rdb3_conv3_weight_to_fp16, x = input_47_cast_fp16)[name = tensor<string, []>("input_49_cast_fp16")];
            tensor<fp16, [1, 32, 256, 256]> x3_5_cast_fp16 = leaky_relu(alpha = var_7_to_fp16, x = input_49_cast_fp16)[name = tensor<string, []>("x3_5_cast_fp16")];
            tensor<bool, []> input_51_interleave_0 = const()[name = tensor<string, []>("input_51_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 160, 256, 256]> input_51_cast_fp16 = concat(axis = var_8, interleave = input_51_interleave_0, values = (input_39_cast_fp16, x1_5_cast_fp16, x2_5_cast_fp16, x3_5_cast_fp16))[name = tensor<string, []>("input_51_cast_fp16")];
            tensor<string, []> input_53_pad_type_0 = const()[name = tensor<string, []>("input_53_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_53_pad_0 = const()[name = tensor<string, []>("input_53_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_53_strides_0 = const()[name = tensor<string, []>("input_53_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_53_dilations_0 = const()[name = tensor<string, []>("input_53_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_53_groups_0 = const()[name = tensor<string, []>("input_53_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 160, 3, 3]> rrdb_body_0_rdb3_conv4_weight_to_fp16 = const()[name = tensor<string, []>("rrdb_body_0_rdb3_conv4_weight_to_fp16"), val = tensor<fp16, [32, 160, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1141120)))];
            tensor<fp16, [32]> rrdb_body_0_rdb3_conv4_bias_to_fp16 = const()[name = tensor<string, []>("rrdb_body_0_rdb3_conv4_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1233344)))];
            tensor<fp16, [1, 32, 256, 256]> input_53_cast_fp16 = conv(bias = rrdb_body_0_rdb3_conv4_bias_to_fp16, dilations = input_53_dilations_0, groups = input_53_groups_0, pad = input_53_pad_0, pad_type = input_53_pad_type_0, strides = input_53_strides_0, weight = rrdb_body_0_rdb3_conv4_weight_to_fp16, x = input_51_cast_fp16)[name = tensor<string, []>("input_53_cast_fp16")];
            tensor<fp16, [1, 32, 256, 256]> x4_5_cast_fp16 = leaky_relu(alpha = var_7_to_fp16, x = input_53_cast_fp16)[name = tensor<string, []>("x4_5_cast_fp16")];
            tensor<bool, []> input_55_interleave_0 = const()[name = tensor<string, []>("input_55_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 192, 256, 256]> input_55_cast_fp16 = concat(axis = var_8, interleave = input_55_interleave_0, values = (input_39_cast_fp16, x1_5_cast_fp16, x2_5_cast_fp16, x3_5_cast_fp16, x4_5_cast_fp16))[name = tensor<string, []>("input_55_cast_fp16")];
            tensor<string, []> x5_5_pad_type_0 = const()[name = tensor<string, []>("x5_5_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x5_5_pad_0 = const()[name = tensor<string, []>("x5_5_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> x5_5_strides_0 = const()[name = tensor<string, []>("x5_5_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> x5_5_dilations_0 = const()[name = tensor<string, []>("x5_5_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> x5_5_groups_0 = const()[name = tensor<string, []>("x5_5_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 192, 3, 3]> var_215_weight_0_to_fp16 = const()[name = tensor<string, []>("op_215_weight_0_to_fp16"), val = tensor<fp16, [64, 192, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1233472)))];
            tensor<fp16, [64]> var_215_bias_0_to_fp16 = const()[name = tensor<string, []>("op_215_bias_0_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1454720)))];
            tensor<fp16, [1, 64, 256, 256]> var_215_cast_fp16 = conv(bias = var_215_bias_0_to_fp16, dilations = x5_5_dilations_0, groups = x5_5_groups_0, pad = x5_5_pad_0, pad_type = x5_5_pad_type_0, strides = x5_5_strides_0, weight = var_215_weight_0_to_fp16, x = input_55_cast_fp16)[name = tensor<string, []>("op_215_cast_fp16")];
            tensor<fp16, [1, 64, 256, 256]> out_1_cast_fp16 = add(x = var_215_cast_fp16, y = input_39_cast_fp16)[name = tensor<string, []>("out_1_cast_fp16")];
            tensor<fp16, []> var_217_to_fp16 = const()[name = tensor<string, []>("op_217_to_fp16"), val = tensor<fp16, []>(0x1.998p-3)];
            tensor<fp16, [1, 64, 256, 256]> var_218_cast_fp16 = mul(x = out_1_cast_fp16, y = var_217_to_fp16)[name = tensor<string, []>("op_218_cast_fp16")];
            tensor<fp16, [1, 64, 256, 256]> input_57_cast_fp16 = add(x = var_218_cast_fp16, y = input_3_cast_fp16)[name = tensor<string, []>("input_57_cast_fp16")];
            tensor<string, []> input_59_pad_type_0 = const()[name = tensor<string, []>("input_59_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_59_pad_0 = const()[name = tensor<string, []>("input_59_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_59_strides_0 = const()[name = tensor<string, []>("input_59_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_59_dilations_0 = const()[name = tensor<string, []>("input_59_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_59_groups_0 = const()[name = tensor<string, []>("input_59_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 64, 3, 3]> rrdb_body_1_rdb1_conv1_weight_to_fp16 = const()[name = tensor<string, []>("rrdb_body_1_rdb1_conv1_weight_to_fp16"), val = tensor<fp16, [32, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1454912)))];
            tensor<fp16, [32]> rrdb_body_1_rdb1_conv1_bias_to_fp16 = const()[name = tensor<string, []>("rrdb_body_1_rdb1_conv1_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1491840)))];
            tensor<fp16, [1, 32, 256, 256]> input_59_cast_fp16 = conv(bias = rrdb_body_1_rdb1_conv1_bias_to_fp16, dilations = input_59_dilations_0, groups = input_59_groups_0, pad = input_59_pad_0, pad_type = input_59_pad_type_0, strides = input_59_strides_0, weight = rrdb_body_1_rdb1_conv1_weight_to_fp16, x = input_57_cast_fp16)[name = tensor<string, []>("input_59_cast_fp16")];
            tensor<fp16, [1, 32, 256, 256]> x1_7_cast_fp16 = leaky_relu(alpha = var_7_to_fp16, x = input_59_cast_fp16)[name = tensor<string, []>("x1_7_cast_fp16")];
            tensor<bool, []> input_61_interleave_0 = const()[name = tensor<string, []>("input_61_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 96, 256, 256]> input_61_cast_fp16 = concat(axis = var_8, interleave = input_61_interleave_0, values = (input_57_cast_fp16, x1_7_cast_fp16))[name = tensor<string, []>("input_61_cast_fp16")];
            tensor<string, []> input_63_pad_type_0 = const()[name = tensor<string, []>("input_63_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_63_pad_0 = const()[name = tensor<string, []>("input_63_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_63_strides_0 = const()[name = tensor<string, []>("input_63_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_63_dilations_0 = const()[name = tensor<string, []>("input_63_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_63_groups_0 = const()[name = tensor<string, []>("input_63_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 96, 3, 3]> rrdb_body_1_rdb1_conv2_weight_to_fp16 = const()[name = tensor<string, []>("rrdb_body_1_rdb1_conv2_weight_to_fp16"), val = tensor<fp16, [32, 96, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1491968)))];
            tensor<fp16, [32]> rrdb_body_1_rdb1_conv2_bias_to_fp16 = const()[name = tensor<string, []>("rrdb_body_1_rdb1_conv2_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1547328)))];
            tensor<fp16, [1, 32, 256, 256]> input_63_cast_fp16 = conv(bias = rrdb_body_1_rdb1_conv2_bias_to_fp16, dilations = input_63_dilations_0, groups = input_63_groups_0, pad = input_63_pad_0, pad_type = input_63_pad_type_0, strides = input_63_strides_0, weight = rrdb_body_1_rdb1_conv2_weight_to_fp16, x = input_61_cast_fp16)[name = tensor<string, []>("input_63_cast_fp16")];
            tensor<fp16, [1, 32, 256, 256]> x2_7_cast_fp16 = leaky_relu(alpha = var_7_to_fp16, x = input_63_cast_fp16)[name = tensor<string, []>("x2_7_cast_fp16")];
            tensor<bool, []> input_65_interleave_0 = const()[name = tensor<string, []>("input_65_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 128, 256, 256]> input_65_cast_fp16 = concat(axis = var_8, interleave = input_65_interleave_0, values = (input_57_cast_fp16, x1_7_cast_fp16, x2_7_cast_fp16))[name = tensor<string, []>("input_65_cast_fp16")];
            tensor<string, []> input_67_pad_type_0 = const()[name = tensor<string, []>("input_67_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_67_pad_0 = const()[name = tensor<string, []>("input_67_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_67_strides_0 = const()[name = tensor<string, []>("input_67_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_67_dilations_0 = const()[name = tensor<string, []>("input_67_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_67_groups_0 = const()[name = tensor<string, []>("input_67_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 128, 3, 3]> rrdb_body_1_rdb1_conv3_weight_to_fp16 = const()[name = tensor<string, []>("rrdb_body_1_rdb1_conv3_weight_to_fp16"), val = tensor<fp16, [32, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1547456)))];
            tensor<fp16, [32]> rrdb_body_1_rdb1_conv3_bias_to_fp16 = const()[name = tensor<string, []>("rrdb_body_1_rdb1_conv3_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1621248)))];
            tensor<fp16, [1, 32, 256, 256]> input_67_cast_fp16 = conv(bias = rrdb_body_1_rdb1_conv3_bias_to_fp16, dilations = input_67_dilations_0, groups = input_67_groups_0, pad = input_67_pad_0, pad_type = input_67_pad_type_0, strides = input_67_strides_0, weight = rrdb_body_1_rdb1_conv3_weight_to_fp16, x = input_65_cast_fp16)[name = tensor<string, []>("input_67_cast_fp16")];
            tensor<fp16, [1, 32, 256, 256]> x3_7_cast_fp16 = leaky_relu(alpha = var_7_to_fp16, x = input_67_cast_fp16)[name = tensor<string, []>("x3_7_cast_fp16")];
            tensor<bool, []> input_69_interleave_0 = const()[name = tensor<string, []>("input_69_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 160, 256, 256]> input_69_cast_fp16 = concat(axis = var_8, interleave = input_69_interleave_0, values = (input_57_cast_fp16, x1_7_cast_fp16, x2_7_cast_fp16, x3_7_cast_fp16))[name = tensor<string, []>("input_69_cast_fp16")];
            tensor<string, []> input_71_pad_type_0 = const()[name = tensor<string, []>("input_71_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_71_pad_0 = const()[name = tensor<string, []>("input_71_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_71_strides_0 = const()[name = tensor<string, []>("input_71_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_71_dilations_0 = const()[name = tensor<string, []>("input_71_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_71_groups_0 = const()[name = tensor<string, []>("input_71_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 160, 3, 3]> rrdb_body_1_rdb1_conv4_weight_to_fp16 = const()[name = tensor<string, []>("rrdb_body_1_rdb1_conv4_weight_to_fp16"), val = tensor<fp16, [32, 160, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1621376)))];
            tensor<fp16, [32]> rrdb_body_1_rdb1_conv4_bias_to_fp16 = const()[name = tensor<string, []>("rrdb_body_1_rdb1_conv4_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1713600)))];
            tensor<fp16, [1, 32, 256, 256]> input_71_cast_fp16 = conv(bias = rrdb_body_1_rdb1_conv4_bias_to_fp16, dilations = input_71_dilations_0, groups = input_71_groups_0, pad = input_71_pad_0, pad_type = input_71_pad_type_0, strides = input_71_strides_0, weight = rrdb_body_1_rdb1_conv4_weight_to_fp16, x = input_69_cast_fp16)[name = tensor<string, []>("input_71_cast_fp16")];
            tensor<fp16, [1, 32, 256, 256]> x4_7_cast_fp16 = leaky_relu(alpha = var_7_to_fp16, x = input_71_cast_fp16)[name = tensor<string, []>("x4_7_cast_fp16")];
            tensor<bool, []> input_73_interleave_0 = const()[name = tensor<string, []>("input_73_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 192, 256, 256]> input_73_cast_fp16 = concat(axis = var_8, interleave = input_73_interleave_0, values = (input_57_cast_fp16, x1_7_cast_fp16, x2_7_cast_fp16, x3_7_cast_fp16, x4_7_cast_fp16))[name = tensor<string, []>("input_73_cast_fp16")];
            tensor<string, []> x5_7_pad_type_0 = const()[name = tensor<string, []>("x5_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x5_7_pad_0 = const()[name = tensor<string, []>("x5_7_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> x5_7_strides_0 = const()[name = tensor<string, []>("x5_7_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> x5_7_dilations_0 = const()[name = tensor<string, []>("x5_7_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> x5_7_groups_0 = const()[name = tensor<string, []>("x5_7_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 192, 3, 3]> var_276_weight_0_to_fp16 = const()[name = tensor<string, []>("op_276_weight_0_to_fp16"), val = tensor<fp16, [64, 192, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1713728)))];
            tensor<fp16, [64]> var_276_bias_0_to_fp16 = const()[name = tensor<string, []>("op_276_bias_0_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1934976)))];
            tensor<fp16, [1, 64, 256, 256]> var_276_cast_fp16 = conv(bias = var_276_bias_0_to_fp16, dilations = x5_7_dilations_0, groups = x5_7_groups_0, pad = x5_7_pad_0, pad_type = x5_7_pad_type_0, strides = x5_7_strides_0, weight = var_276_weight_0_to_fp16, x = input_73_cast_fp16)[name = tensor<string, []>("op_276_cast_fp16")];
            tensor<fp16, [1, 64, 256, 256]> input_75_cast_fp16 = add(x = var_276_cast_fp16, y = input_57_cast_fp16)[name = tensor<string, []>("input_75_cast_fp16")];
            tensor<string, []> input_77_pad_type_0 = const()[name = tensor<string, []>("input_77_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_77_pad_0 = const()[name = tensor<string, []>("input_77_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_77_strides_0 = const()[name = tensor<string, []>("input_77_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_77_dilations_0 = const()[name = tensor<string, []>("input_77_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_77_groups_0 = const()[name = tensor<string, []>("input_77_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 64, 3, 3]> rrdb_body_1_rdb2_conv1_weight_to_fp16 = const()[name = tensor<string, []>("rrdb_body_1_rdb2_conv1_weight_to_fp16"), val = tensor<fp16, [32, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1935168)))];
            tensor<fp16, [32]> rrdb_body_1_rdb2_conv1_bias_to_fp16 = const()[name = tensor<string, []>("rrdb_body_1_rdb2_conv1_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1972096)))];
            tensor<fp16, [1, 32, 256, 256]> input_77_cast_fp16 = conv(bias = rrdb_body_1_rdb2_conv1_bias_to_fp16, dilations = input_77_dilations_0, groups = input_77_groups_0, pad = input_77_pad_0, pad_type = input_77_pad_type_0, strides = input_77_strides_0, weight = rrdb_body_1_rdb2_conv1_weight_to_fp16, x = input_75_cast_fp16)[name = tensor<string, []>("input_77_cast_fp16")];
            tensor<fp16, [1, 32, 256, 256]> x1_9_cast_fp16 = leaky_relu(alpha = var_7_to_fp16, x = input_77_cast_fp16)[name = tensor<string, []>("x1_9_cast_fp16")];
            tensor<bool, []> input_79_interleave_0 = const()[name = tensor<string, []>("input_79_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 96, 256, 256]> input_79_cast_fp16 = concat(axis = var_8, interleave = input_79_interleave_0, values = (input_75_cast_fp16, x1_9_cast_fp16))[name = tensor<string, []>("input_79_cast_fp16")];
            tensor<string, []> input_81_pad_type_0 = const()[name = tensor<string, []>("input_81_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_81_pad_0 = const()[name = tensor<string, []>("input_81_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_81_strides_0 = const()[name = tensor<string, []>("input_81_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_81_dilations_0 = const()[name = tensor<string, []>("input_81_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_81_groups_0 = const()[name = tensor<string, []>("input_81_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 96, 3, 3]> rrdb_body_1_rdb2_conv2_weight_to_fp16 = const()[name = tensor<string, []>("rrdb_body_1_rdb2_conv2_weight_to_fp16"), val = tensor<fp16, [32, 96, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1972224)))];
            tensor<fp16, [32]> rrdb_body_1_rdb2_conv2_bias_to_fp16 = const()[name = tensor<string, []>("rrdb_body_1_rdb2_conv2_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2027584)))];
            tensor<fp16, [1, 32, 256, 256]> input_81_cast_fp16 = conv(bias = rrdb_body_1_rdb2_conv2_bias_to_fp16, dilations = input_81_dilations_0, groups = input_81_groups_0, pad = input_81_pad_0, pad_type = input_81_pad_type_0, strides = input_81_strides_0, weight = rrdb_body_1_rdb2_conv2_weight_to_fp16, x = input_79_cast_fp16)[name = tensor<string, []>("input_81_cast_fp16")];
            tensor<fp16, [1, 32, 256, 256]> x2_9_cast_fp16 = leaky_relu(alpha = var_7_to_fp16, x = input_81_cast_fp16)[name = tensor<string, []>("x2_9_cast_fp16")];
            tensor<bool, []> input_83_interleave_0 = const()[name = tensor<string, []>("input_83_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 128, 256, 256]> input_83_cast_fp16 = concat(axis = var_8, interleave = input_83_interleave_0, values = (input_75_cast_fp16, x1_9_cast_fp16, x2_9_cast_fp16))[name = tensor<string, []>("input_83_cast_fp16")];
